---
kind: method
id: M:Autodesk.Revit.DB.NurbsSurfaceData.#ctor(Autodesk.Revit.DB.NurbsSurfaceData)
source: html/6fdc9f8a-a443-a69f-2d9b-82cad9bf7544.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.#ctor Method

Copy constructor.

## Syntax (C#)
```csharp
public NurbsSurfaceData(
	NurbsSurfaceData other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.NurbsSurfaceData`) - The NurbsSurfaceData to copy.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null